'''
4. Реалізуйте генератор, який приймає на вхід будь-яку ітерабельну послідовність (рядок, список, кортеж) і повертає генератор, 
який буде повертати значення з цієї послідовності, при цьому, якщо було повернено останній елемент із послідовності - ітерація починається знову.
'''


def my_generator(gen):
    b = 0
    while True:
        try:
            yield gen[b]
        except IndexError:
            b = 0
            yield gen[b]
        b += 1
 
 
a = my_generator([1, 2, 3])

